app/controllers/accounts_controller.rb

    def set_account
      @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ?  ORDER BY "accounts"."id" ASC LIMIT 1  [["id", 5]]