app/controllers/receipts_controller.rb

SELECT "receipts".* FROM "receipts"
---
  def index
    @receipts = Receipt.all