app/controllers/accounts/registrations_controller.rb

  def new
    build_resource({})
    resource.build_employee
    @departments = Department.all
---
SELECT "departments".* FROM "departments"